_posts/2015-08-28-drolay.html
---
layout: view_toc
comments: true
title: Drolay2.0 需求文档
categories: others
tags: jvm
date: 2000-1-1
keywords: jvm
description: jvm
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 团队控管</a>
<ul>
<li><a href="#sec-1-1">1.1. 发布新团</a></li>
<li><a href="#sec-1-2">1.2. <span class="todo TODO">TODO</span> 统筹控位?? D:0.5</a></li>
<li><a href="#sec-1-3">1.3. <span class="todo TODO">TODO</span> 批量调价(批量修改) D:1~2</a></li>
<li><a href="#sec-1-4">1.4. 定时任务</a></li>
<li><a href="#sec-1-5">1.5. 账期</a></li>
<li><a href="#sec-1-6">1.6. 报名(代理商)</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 产品库</a>
<ul>
<li><a href="#sec-2-1">2.1. 创建&amp;编辑新产品</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. 境外</a>
<ul>
<li><a href="#sec-2-1-1-1">2.1.1.1. 编辑基本信息</a></li>
<li><a href="#sec-2-1-1-2">2.1.1.2. 编辑参考行程</a></li>
<li><a href="#sec-2-1-1-3">2.1.1.3. 编辑可选自费项目</a></li>
<li><a href="#sec-2-1-1-4">2.1.1.4. 编辑购物信息</a></li>
<li><a href="#sec-2-1-1-5">2.1.1.5. 编辑模板</a></li>
</ul>
</li>
<li><a href="#sec-2-1-2">2.1.2. 国内</a>
<ul>
<li><a href="#sec-2-1-2-1">2.1.2.1. 交通方式</a></li>
<li><a href="#sec-2-1-2-2">2.1.2.2. 参考行程编辑</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 产品复制</a></li>
<li><a href="#sec-2-3">2.3. 产品删除</a></li>
<li><a href="#sec-2-4">2.4. 产品查询</a></li>
<li><a href="#sec-2-5">2.5. 出发地</a></li>
<li><a href="#sec-2-6">2.6. 目的地</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 国内</a></li>
<li><a href="#sec-2-6-2">2.6.2. 国外</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 产品类型&amp;主题</a></li>
</ul>
</li>
<li><a href="#sec-3">3. <span class="todo TODO">TODO</span> 产品平移</a></li>
<li><a href="#sec-4">4. <span class="todo TODO">TODO</span> 轨迹</a></li>
<li><a href="#sec-5">5. 订单控管(c:毛叔)</a>
<ul>
<li><a href="#sec-5-1">5.1. 查询订单列表，查看订单，退团，修改订单金额，添加联系人(代理商)，添加游客，添加费用，添加备注，客户查询查看打印</a></li>
<li><a href="#sec-5-2">5.2. <span class="todo TODO">TODO</span> 收支确认单-收款审批 D:0.5</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 收支项(c:毛叔)</a></li>
<li><a href="#sec-7">7. 代理商管理(c:毛叔)</a>
<ul>
<li><a href="#sec-7-1">7.1. <span class="todo TODO">TODO</span> 销售专员 delay to doc done</a></li>
</ul>
</li>
<li><a href="#sec-8">8. 直客管理(c:于娜)</a></li>
<li><a href="#sec-9">9. 签证管理(c:张千鸿)</a></li>
<li><a href="#sec-10">10. 业务统计表(to:俊明)</a></li>
<li><a href="#sec-11">11. 财务统计表(to:俊明)</a></li>
<li><a href="#sec-12">12. 统计分析(to:俊明)</a>
<ul>
<li><a href="#sec-12-1">12.1. 概况</a></li>
<li><a href="#sec-12-2">12.2. 目的地</a></li>
<li><a href="#sec-12-3">12.3. 代理商</a></li>
<li><a href="#sec-12-4">12.4. 流量统计</a></li>
</ul>
</li>
<li><a href="#sec-13">13. <span class="todo TODO">TODO</span> 本部管理(c:建青) 需要维护</a>
<ul>
<li><a href="#sec-13-1">13.1. <span class="todo TODO">TODO</span> 企业账户 D:0.5~1</a></li>
<li><a href="#sec-13-2">13.2. 组织架构</a></li>
<li><a href="#sec-13-3">13.3. 部门管理</a></li>
<li><a href="#sec-13-4">13.4. 角色管理</a></li>
<li><a href="#sec-13-5">13.5. 账户管理</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="main">



<!-- more -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 团队控管</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 发布新团</h3>
<div class="outline-text-3" id="text-1-1">
<p>
计划人数，领队人数算在计划人数里。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> 统筹控位?? D:0.5</h3>
<div class="outline-text-3" id="text-1-2">
<p>
因为供应商同时开了几个团，需要根据哪个团的报名情况最好，人工进行票位分配。
</p>

<p>
供应商对自己持有票数(线下)进行对子团的调控，只有在报名中的团并且为同一天的子团进行票位分配。
票位分配区间，(已报名人数~(计划人数-1))
票位影响报名和出团。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> 批量调价(批量修改) D:1~2</h3>
<div class="outline-text-3" id="text-1-3">
<p>
可批量修改子团的计划人数，同行价，市场价，和截止子团。国内的交通方式分为多条来算。
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 定时任务</h3>
<div class="outline-text-3" id="text-1-4">
<p>
订单状态为 <b>确认&amp;款清</b> 到期做出团设置。出团状态到期做回团处理
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 账期</h3>
<div class="outline-text-3" id="text-1-5">
<p>
供应商账期，子团账期。回团以后+账期提交自动结款
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 报名(代理商)</h3>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 产品库</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 创建&amp;编辑新产品</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 境外</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><div id="outline-container-sec-2-1-1-1" class="outline-5">
<h5 id="sec-2-1-1-1"><span class="section-number-5">2.1.1.1</span> 编辑基本信息</h5>
<div class="outline-text-5" id="text-2-1-1-1">
<p>
产品名称(r),出发城市(单select)-从供应商出发地里面选,目的地(3select)-从供应商目的地里选,类型&amp;主题,途径目的地(列出目的地省份下的所有城市可选可添加).
</p>
</div>
</div>
<div id="outline-container-sec-2-1-1-2" class="outline-5">
<h5 id="sec-2-1-1-2"><span class="section-number-5">2.1.1.2</span> 编辑参考行程</h5>
<div class="outline-text-5" id="text-2-1-1-2">
<p>
编辑一条旅游线路的行程安排信息.第几天的行程名称,详细内容,酒店星级&amp;名称,早中晚餐.添加目的地图片
</p>
</div>
</div>
<div id="outline-container-sec-2-1-1-3" class="outline-5">
<h5 id="sec-2-1-1-3"><span class="section-number-5">2.1.1.3</span> 编辑可选自费项目</h5>
<div class="outline-text-5" id="text-2-1-1-3">
<p>
去某个国家或者城市的可选自费项目的增删改查,非必须.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-1-4" class="outline-5">
<h5 id="sec-2-1-1-4"><span class="section-number-5">2.1.1.4</span> 编辑购物信息</h5>
<div class="outline-text-5" id="text-2-1-1-4">
<p>
去某个国家或者城市的可购物信息的增删改查,非必须.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-1-5" class="outline-5">
<h5 id="sec-2-1-1-5"><span class="section-number-5">2.1.1.5</span> 编辑模板</h5>
<div class="outline-text-5" id="text-2-1-1-5">
<p>
提供增加和删除内容模板,模板提供给产品的属性:行程特色,费用包含,费用不含,参团须知,备注
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 国内</h4>
<div class="outline-text-4" id="text-2-1-2">
</div><div id="outline-container-sec-2-1-2-1" class="outline-5">
<h5 id="sec-2-1-2-1"><span class="section-number-5">2.1.2.1</span> 交通方式</h5>
<div class="outline-text-5" id="text-2-1-2-1">
<p>
总:飞机,高铁,动车,卧铺,汽车,轮船,硬座,软座
</p>
<ol class="org-ol">
<li>标准
旅游的标准交通方式,出团和回团延迟都为0,即出团&amp;回团当天.
</li>
<li>非标准
可添加多条非标准的交通方式,因为有的游客可能做飞机或者做高铁不等.出团&amp;回团delay为,早一天,当天,晚1天,晚2天
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2-2" class="outline-5">
<h5 id="sec-2-1-2-2"><span class="section-number-5">2.1.2.2</span> 参考行程编辑</h5>
<div class="outline-text-5" id="text-2-1-2-2">
<ul class="org-ul">
<li>根据产品基本信息中选择的行程天数生成相应天数的行程安排,对其进行编辑.
</li>
<li>无图片,其他同境外
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 产品复制</h3>
<div class="outline-text-3" id="text-2-2">
<p>
复制一条或者多条产品信息,产品编号不能相同,创建时间以复制的时间为准
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 产品删除</h3>
<div class="outline-text-3" id="text-2-3">
<p>
将产品状态置为不可用
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 产品查询</h3>
<div class="outline-text-3" id="text-2-4">
<p>
可根据产品类型和关键字检索产品
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 出发地</h3>
<div class="outline-text-3" id="text-2-5">
<p>
数据来源于地区表,省份表(国家),城市表,为当前供应商常用的旅游线路的出发地.国内外暂定都为国内.
</p>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 目的地</h3>
<div class="outline-text-3" id="text-2-6">
<p>
数据来源于地区表,省份表(国家),城市表,为当前供应商常用的旅游线路目的地
</p>
</div>
<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 国内</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
添加和删除目的地城市,需要关联显示省份等信息
</p>
</div>
</div>
<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> 国外</h4>
<div class="outline-text-4" id="text-2-6-2">
<ul class="org-ul">
<li>添加和删除国家,统计当前供应商下每个国家的目的地城市数量
</li>
<li>添加和删除目的地城市,并可以为目的地城市添加图片,在境外编辑产品选择行程的时候会用到.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 产品类型&amp;主题</h3>
<div class="outline-text-3" id="text-2-7">
<p>
对产品主题的增删改查,在编辑产品的时候加载当前用户的主题&amp;类型
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> 产品平移</h2>
<div class="outline-text-2" id="text-3">
<p>
将供应商用户的子团转给其他用户，改变属主
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> 轨迹</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 订单控管(c:毛叔)</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 查询订单列表，查看订单，退团，修改订单金额，添加联系人(代理商)，添加游客，添加费用，添加备注，客户查询查看打印</h3>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> 收支确认单-收款审批 D:0.5</h3>
<div class="outline-text-3" id="text-5-2">
<p>
收款审批和确认收款的状态改变，线下流程线上录入。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 收支项(c:毛叔)</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 代理商管理(c:毛叔)</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> <span class="todo TODO">TODO</span> 销售专员 delay to doc done</h3>
</div>
</div>




<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 直客管理(c:于娜)</h2>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 签证管理(c:张千鸿)</h2>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 业务统计表(to:俊明)</h2>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 财务统计表(to:俊明)</h2>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 统计分析(to:俊明)</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 概况</h3>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 目的地</h3>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> 代理商</h3>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> 流量统计</h3>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <span class="todo TODO">TODO</span> 本部管理(c:建青) 需要维护</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> <span class="todo TODO">TODO</span> 企业账户 D:0.5~1</h3>
<div class="outline-text-3" id="text-13-1">
<p>
添加企业账户的支付信息。
类型     开户行     账号     开户名     创建日期     操作
</p>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> 组织架构</h3>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> 部门管理</h3>
</div>
<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> 角色管理</h3>
</div>
<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> 账户管理</h3>
<div class="outline-text-3" id="text-13-5">
</div>
</div>
</div>
</div>
